{
  "[PAD]": 0,
  "[UNK]": 1,
  "[BOS]": 2,
  "[EOS]": 3,
  "\t": 4,
  "\n": 5,
  "\f": 6,
  "\r": 7,
  " ": 8,
  "!": 9,
  "\"": 10,
  "#": 11,
  "$": 12,
  "%": 13,
  "&": 14,
  "'": 15,
  "(": 16,
  ")": 17,
  "*": 18,
  "+": 19,
  ",": 20,
  "-": 21,
  ".": 22,
  "/": 23,
  "0": 24,
  "1": 25,
  "2": 26,
  "3": 27,
  "4": 28,
  "5": 29,
  "6": 30,
  "7": 31,
  "8": 32,
  "9": 33,
  ":": 34,
  ";": 35,
  "<": 36,
  "=": 37,
  ">": 38,
  "?": 39,
  "@": 40,
  "A": 41,
  "B": 42,
  "C": 43,
  "D": 44,
  "E": 45,
  "F": 46,
  "G": 47,
  "H": 48,
  "I": 49,
  "J": 50,
  "K": 51,
  "L": 52,
  "M": 53,
  "N": 54,
  "O": 55,
  "P": 56,
  "Q": 57,
  "R": 58,
  "S": 59,
  "T": 60,
  "U": 61,
  "V": 62,
  "W": 63,
  "X": 64,
  "Y": 65,
  "Z": 66,
  "[": 67,
  "\\": 68,
  "]": 69,
  "^": 70,
  "_": 71,
  "`": 72,
  "a": 73,
  "b": 74,
  "c": 75,
  "d": 76,
  "e": 77,
  "f": 78,
  "g": 79,
  "h": 80,
  "i": 81,
  "j": 82,
  "k": 83,
  "l": 84,
  "m": 85,
  "n": 86,
  "o": 87,
  "p": 88,
  "q": 89,
  "r": 90,
  "s": 91,
  "t": 92,
  "u": 93,
  "v": 94,
  "w": 95,
  "x": 96,
  "y": 97,
  "z": 98,
  "{": 99,
  "|": 100,
  "}": 101,
  "~": 102,
  "�": 103,
  " t": 104,
  "he": 105,
  " a": 106,
  " i": 107,
  " the": 108,
  "  ": 109,
  "re": 110,
  " s": 111,
  " c": 112,
  "in": 113,
  "er": 114,
  "on": 115,
  "or": 116,
  "at": 117,
  " p": 118,
  "le": 119,
  " is": 120,
  " b": 121,
  " w": 122,
  " m": 123,
  " f": 124,
  " e": 125,
  "ut": 126,
  "it": 127,
  " o": 128,
  " in": 129,
  "es": 130,
  "en": 131,
  "    ": 132,
  " n": 133,
  "al": 134,
  " (": 135,
  " an": 136,
  "ro": 137,
  " th": 138,
  " to": 139,
  " d": 140,
  "ion": 141,
  "an": 142,
  "ing": 143,
  "ac": 144,
  "ed": 145,
  "st": 146,
  " of": 147,
  " =": 148,
  "ar": 149,
  "um": 150,
  " and": 151,
  " 1": 152,
  "ic": 153,
  " co": 154,
  " S": 155,
  "se": 156,
  " +": 157,
  "ct": 158,
  " be": 159,
  " -": 160,
  "'s": 161,
  " for": 162,
  "ve": 163,
  "ent": 164,
  "mp": 165,
  " h": 166,
  " re": 167,
  "ou": 168,
  "The": 169,
  "ot": 170,
  "is": 171,
  " l": 172,
  " So": 173,
  " 2": 174,
  "et": 175,
  " that": 176,
  "ig": 177,
  "ach": 178,
  "im": 179,
  " st": 180,
  "ly": 181,
  "But": 182,
  "de": 183,
  "qu": 184,
  "ce": 185,
  "os": 186,
  "ll": 187,
  "ay": 188,
  " \\": 189,
  "ble": 190,
  " are": 191,
  "ow": 192,
  "$$": 193,
  " g": 194,
  "ir": 195,
  "ter": 196,
  "as": 197,
  " The": 198,
  "ld": 199,
  "nt": 200,
  " con": 201,
  " u": 202,
  " x": 203,
  " pro": 204,
  "   ": 205,
  "\n    ": 206,
  " each": 207,
  " if": 208,
  " can": 209,
  ").": 210,
  " v": 211,
  " ex": 212,
  "ation": 213,
  "si": 214,
  " le": 215,
  " so": 216,
  " 0": 217,
  "ment": 218,
  " on": 219,
  " di": 220,
  " this": 221,
  " pos": 222,
  " r": 223,
  " su": 224,
  "),": 225,
  " wh": 226,
  " k": 227,
  " or": 228,
  " we": 229,
  "ith": 230,
  " y": 231,
  " ne": 232,
  " A": 233,
  "pp": 234,
  "ur": 235,
  " whe": 236,
  " mo": 237,
  "ait": 238,
  "ich": 239,
  " I": 240,
  " se": 241,
  "ive": 242,
  " as": 243,
  " sum": 244,
  "mple": 245,
  "id": 246,
  "ould": 247,
  " 3": 248,
  "igh": 249,
  " all": 250,
  " with": 251,
  " ma": 252,
  " it": 253,
  " B": 254,
  "ps": 255,
  "For": 256,
  " not": 257,
  "her": 258,
  " But": 259,
  "ul": 260,
  " but": 261,
  "ber": 262,
  "rom": 263,
  "Wait": 264,
  "int": 265,
  " num": 266,
  "ight": 267,
  " then": 268,
  " which": 269,
  "ver": 270,
  "ate": 271,
  " C": 272,
  "ge": 273,
  " L": 274,
  " per": 275,
  "$$$": 276,
  " would": 277,
  " number": 278,
  "am": 279,
  "ample": 280,
  "rent": 281,
  "tion": 282,
  " ch": 283,
  "art": 284,
  "00": 285,
  "ff": 286,
  " at": 287,
  " from": 288,
  " no": 289,
  " by": 290,
  "us": 291,
  " ele": 292,
  "So": 293,
  "ain": 294,
  "ition": 295,
  "th": 296,
  " comp": 297,
  "rect": 298,
  "sible": 299,
  " tr": 300,
  " int": 301,
  "ad": 302,
  "iv": 303,
  "\n        ": 304,
  "ck": 305,
  " <": 306,
  " app": 307,
  " For": 308,
  "ch": 309,
  "ces": 310,
  "res": 311,
  "ative": 312,
  "ave": 313,
  "ust": 314,
  "irst": 315,
  "Th": 316,
  "ase": 317,
  " de": 318,
  " 4": 319,
  "ore": 320,
  " \\(": 321,
  " possible": 322,
  "il": 323,
  " *": 324,
  "blem": 325,
  "ute": 326,
  " max": 327,
  " op": 328,
  "nd": 329,
  " element": 330,
  "ince": 331,
  "put": 332,
  " problem": 333,
  "wer": 334,
  "tern": 335,
  "\n\n": 336,
  "ref": 337,
  " have": 338,
  "ha": 339,
  "be": 340,
  " me": 341,
  " >": 342,
  "swer": 343,
  " sp": 344,
  " example": 345,
  "ial": 346,
  " ste": 347,
  " tw": 348,
  " H": 349,
  "est": 350,
  " appro": 351,
  " min": 352,
  "ity": 353,
  " D": 354,
  " qu": 355,
  "ke": 356,
  " first": 357,
  " answer": 358,
  " Let": 359,
  " ro": 360,
  "om": 361,
  " must": 362,
  " he": 363,
  " two": 364,
  " equ": 365,
  "orrect": 366,
  " where": 367,
  " code": 368,
  " j": 369,
  "dd": 370,
  " [": 371,
  " when": 372,
  " ar": 373,
  "lo": 374,
  " may": 375,
  "ltern": 376,
  " sub": 377,
  "der": 378,
  "ree": 379,
  " need": 380,
  "ffe": 381,
  "erm": 382,
  "au": 383,
  " →": 384,
  "ind": 385,
  "heck": 386,
  " Then": 387,
  "haps": 388,
  "lternative": 389,
  " po": 390,
  "ime": 391,
  " 5": 392,
  "urrent": 393,
  "ist": 394,
  "ue": 395,
  " pa": 396,
  " approach": 397,
  " cou": 398,
  "ip": 399,
  " val": 400,
  "if": 401,
  "cess": 402,
  " inc": 403,
  "rou": 404,
  " Wait": 405,
  "iz": 406,
  " O": 407,
  "\n       ": 408,
  "act": 409,
  "ause": 410,
  "imum": 411,
  " perhaps": 412,
  " there": 413,
  "ame": 414,
  "ther": 415,
  " al": 416,
  "refore": 417,
  " arr": 418,
  "ra": 419,
  "cause": 420,
  " has": 421,
  "inal": 422,
  " case": 423,
  "lternatively": 424,
  " how": 425,
  "bo": 426,
  "red": 427,
  "ang": 428,
  " out": 429,
  " cont": 430,
  " N": 431,
  " ed": 432,
  "..": 433,
  "ine": 434,
  "ack": 435,
  " $$$": 436,
  " M": 437,
  "\n\n  ": 438,
  "uct": 439,
  "ution": 440,
  "'t": 441,
  "ink": 442,
  " correct": 443,
  " If": 444,
  " elements": 445,
  " one": 446,
  "ult": 447,
  " current": 448,
  "ft": 449,
  "les": 450,
  " z": 451,
  "ond": 452,
  "ri": 453,
  " maybe": 454,
  " check": 455,
  " giv": 456,
  " \n": 457,
  " position": 458,
  " sol": 459,
  "end": 460,
  " {": 461,
  " /": 462,
  "and": 463,
  " E": 464,
  " up": 465,
  " P": 466,
  " ev": 467,
  " str": 468,
  " part": 469,
  " bet": 470,
  "fter": 471,
  "\n   ": 472,
  " maximum": 473,
  " point": 474,
  " do": 475,
  "ies": 476,
  " us": 477,
  "ol": 478,
  "10": 479,
  " ac": 480,
  "ect": 481,
  " diffe": 482,
  " compute": 483,
  " any": 484,
  "qr": 485,
  " '": 486,
  " rem": 487,
  "qrt": 488,
  " pl": 489,
  "val": 490,
  "Alternatively": 491,
  "tal": 492,
  " col": 493,
  ")/": 494,
  "``": 495,
  " such": 496,
  "we": 497,
  "ong": 498,
  " add": 499,
  "ose": 500,
  "ure": 501,
  " pair": 502,
  " process": 503,
  "ert": 504,
  " you": 505,
  "its": 506,
  " same": 507,
  " find": 508,
  " exp": 509,
  " array": 510,
  " 6": 511,
  "\n            ": 512,
  "xt": 513,
  "ng": 514,
  "lu": 515,
  " som": 516,
  " form": 517,
  " right": 518,
  "ers": 519,
  " mod": 520,
  "ween": 521,
  "mm": 522,
  " W": 523,
  " inter": 524,
  " T": 525,
  "all": 526,
  "iginal": 527,
  "ant": 528,
  " their": 529,
  "ard": 530,
  "imal": 531,
  " between": 532,
  " time": 533,
  " term": 534,
  " option": 535,
  "ations": 536,
  " >=": 537,
  " un": 538,
  " even": 539,
  " count": 540,
  "ates": 541,
  "ord": 542,
  "ical": 543,
  "ill": 544,
  " sh": 545,
  "ix": 546,
  "em": 547,
  " R": 548,
  " other": 549,
  "eg": 550,
  " since": 551,
  "ath": 552,
  "ort": 553,
  " after": 554,
  " \"": 555,
  "Thus": 556,
  "able": 557,
  " en": 558,
  "ngth": 559,
  " pre": 560,
  "ast": 561,
  " total": 562,
  "li": 563,
  " Therefore": 564,
  " let": 565,
  " steps": 566,
  "sum": 567,
  " set": 568,
  "**": 569,
  " solution": 570,
  "ays": 571,
  "ren": 572,
  "ors": 573,
  "rac": 574,
  "ance": 575,
  " than": 576,
  "ange": 577,
  "_{": 578,
  "\n           ": 579,
  " <=": 580,
  "ma": 581,
  " dist": 582,
  " }": 583,
  " they": 584,
  "un": 585,
  " original": 586,
  "ges": 587,
  " left": 588,
  "ence": 589,
  "ction": 590,
  " ve": 591,
  " into": 592,
  "This": 593,
  " step": 594,
  " output": 595,
  " bot": 596,
  "ans": 597,
  " order": 598,
  "qui": 599,
  " node": 600,
  "^{": 601,
  " start": 602,
  " char": 603,
  "ace": 604,
  "cond": 605,
  ");": 606,
  "].": 607,
  "erg": 608,
  " different": 609,
  "other": 610,
  " given": 611,
  "ated": 612,
  "gh": 613,
  " some": 614,
  " consi": 615,
  " abo": 616,
  " think": 617,
  " 10": 618,
  " sample": 619,
  " requi": 620,
  " only": 621,
  " grou": 622,
  " 9": 623,
  " pr": 624,
  " new": 625,
  " div": 626,
  "ecause": 627,
  " here": 628,
  "ero": 629,
  "ass": 630,
  "ap": 631,
  " const": 632,
  "ultip": 633,
  " path": 634,
  " way": 635,
  "ie": 636,
  "duct": 637,
  "itial": 638,
  " lo": 639,
  "ell": 640,
  " \\)": 641,
  " length": 642,
  "omp": 643,
  "}{": 644,
  "des": 645,
  " mat": 646,
  " does": 647,
  " integ": 648,
  " lar": 649,
  "frac": 650,
  "12": 651,
  " F": 652,
  " both": 653,
  "our": 654,
  "ous": 655,
  " equal": 656,
  "ite": 657,
  "ary": 658,
  " Because": 659,
  ")^": 660,
  " numbers": 661,
  "ize": 662,
  " state": 663,
  "onent": 664,
  " input": 665,
  "for": 666,
  "ases": 667,
  " test": 668,
  " res": 669,
  "imes": 670,
  "ide": 671,
  " |": 672,
  " 8": 673,
  " minimal": 674,
  " )": 675,
  "ta": 676,
  "gment": 677,
  "\n\n    ": 678,
  " non": 679,
  " about": 680,
  "ild": 681,
  "ss": 682,
  " multip": 683,
  "ress": 684,
  " remain": 685,
  "rib": 686,
  " ang": 687,
  "pe": 688,
  " second": 689,
  " ta": 690,
  "ever": 691,
  " 7": 692,
  " How": 693,
  " direct": 694,
  " dig": 695,
  " over": 696,
  "hich": 697,
  " li": 698,
  "ient": 699,
  " options": 700,
  " line": 701,
  " list": 702,
  "],": 703,
  "*(": 704,
  "ving": 705,
  " might": 706,
  " edges": 707,
  "ab": 708,
  " zero": 709,
  " spe": 710,
  "lect": 711,
  "lic": 712,
  " cell": 713,
  "))": 714,
  "11": 715,
  "\n\n   ": 716,
  " sqrt": 717,
  " these": 718,
  " sm": 719,
  " segment": 720,
  " wor": 721,
  " dep": 722,
  "so": 723,
  " sort": 724,
  "urn": 725,
  "ffic": 726,
  "ign": 727,
  " **": 728,
  " them": 729,
  "):": 730,
  " prev": 731,
  "op": 732,
  "od": 733,
  " value": 734,
  " row": 735,
  " equation": 736,
  "cle": 737,
  " inclu": 738,
  "ctor": 739,
  " oper": 740,
  "ari": 741,
  " X": 742,
  "del": 743,
  " interval": 744,
  "estion": 745,
  " G": 746,
  ")=": 747,
  " allow": 748,
  " string": 749,
  " question": 750,
  " because": 751,
  " quer": 752,
  "][": 753,
  " next": 754,
  " pairs": 755,
  "ens": 756,
  "ual": 757,
  "com": 758,
  "```": 759,
  " However": 760,
  "ric": 761,
  "20": 762,
  " end": 763,
  "ilar": 764,
  "imilar": 765,
  "ints": 766,
  " gen": 767,
  "qua": 768,
  "set": 769,
  " product": 770,
  "ves": 771,
  "max": 772,
  "ues": 773,
  "ound": 774,
  " initial": 775,
  " like": 776,
  "gain": 777,
  " more": 778,
  " work": 779,
  " acc": 780,
  " group": 781,
  "lse": 782,
  " should": 783,
  "fficient": 784,
  "lock": 785,
  "ag": 786,
  " trans": 787,
  "resent": 788,
  "ergy": 789,
  "sqrt": 790,
  " wait": 791,
  " three": 792,
  "ased": 793,
  " incre": 794,
  "lit": 795,
  "99": 796,
  " fo": 797,
  " will": 798,
  " squa": 799,
  "ompute": 800,
  " consider": 801,
  " cho": 802,
  " points": 803,
  "itive": 804,
  "ating": 805,
  "angle": 806,
  " det": 807,
  "te": 808,
  " vert": 809,
  "Let": 810,
  "ower": 811,
  "000": 812,
  "ron": 813,
  " ad": 814,
  " terms": 815,
  " edge": 816,
  " again": 817,
  " valid": 818,
  " ==": 819,
  " sy": 820,
  "ater": 821,
  " model": 822,
  "\\)": 823,
  "        ": 824,
  "acter": 825,
  "...": 826,
  " its": 827,
  " cond": 828,
  " energy": 829,
  " positions": 830,
  "rence": 831,
  " nodes": 832,
  "since": 833,
  "ible": 834,
  " Y": 835,
  " sequ": 836,
  "cul": 837,
  " tree": 838,
  " long": 839,
  "unction": 840,
  " elect": 841,
  " com": 842,
  " using": 843,
  " ph": 844,
  "ices": 845,
  "refix": 846,
  "16": 847,
  " becom": 848,
  " see": 849,
  " root": 850,
  " character": 851,
  " condition": 852,
  "ator": 853,
  " gener": 854,
  "\n\n            ": 855,
  "umn": 856,
  " could": 857,
  "In": 858,
  "Therefore": 859,
  " imp": 860,
  " larg": 861,
  " q": 862,
  "king": 863,
  " (-": 864,
  " sorted": 865,
  "pt": 866,
  " act": 867,
  " Since": 868,
  "ious": 869,
  "25": 870,
  " get": 871,
  " rep": 872,
  "ording": 873,
  "hes": 874,
  " In": 875,
  "15": 876,
  " function": 877,
  " use": 878,
  " adj": 879,
  " contrib": 880,
  " distance": 881,
  " angle": 882,
  " ke": 883,
  "ions": 884,
  "\n  ": 885,
  " column": 886,
  " wr": 887,
  " exact": 888,
  " determ": 889,
  "ems": 890,
  " gra": 891,
  " ent": 892,
  " ret": 893,
  "An": 894,
  "own": 895,
  " hig": 896,
  "out": 897,
  " inde": 898,
  "ting": 899,
  " par": 900,
  " vector": 901,
  " rel": 902,
  "pos": 903,
  "ount": 904,
  " component": 905,
  " divis": 906,
  " subst": 907,
  " sc": 908,
  " gives": 909,
  " becomes": 910,
  " previous": 911,
  "rough": 912,
  " another": 913,
  " cos": 914,
  "cur": 915,
  " subt": 916,
  "one": 917,
  "age": 918,
  " fact": 919,
  " through": 920,
  "Now": 921,
  " bit": 922,
  " ty": 923,
  "ph": 924,
  " block": 925,
  " cy": 926,
  " lead": 927,
  " dec": 928,
  " query": 929,
  "llow": 930,
  " man": 931,
  " remaining": 932,
  "the": 933,
  "think": 934,
  " return": 935,
  " sin": 936,
  " te": 937,
  " says": 938,
  "du": 939,
  " according": 940,
  " constra": 941,
  "vers": 942,
  " sequence": 943,
  " positive": 944,
  " follow": 945,
  "ise": 946,
  " take": 947,
  "imilarly": 948,
  "ffect": 949,
  " split": 950,
  "ides": 951,
  "form": 952,
  " range": 953,
  " child": 954,
  "alle": 955,
  " digits": 956,
  "app": 957,
  "alcul": 958,
  " small": 959,
  " prefix": 960,
  "ield": 961,
  " formul": 962,
  " This": 963,
  " values": 964,
  "nect": 965,
  " go": 966,
  " last": 967,
  "/(": 968,
  " subset": 969,
  " tri": 970,
  " else": 971,
  " exist": 972,
  " perm": 973,
  "13": 974,
  "ved": 975,
  " cl": 976,
  " K": 977,
  "bs": 978,
  "Then": 979,
  "uring": 980,
  " move": 981,
  " depend": 982,
  " direction": 983,
  " exactly": 984,
  "ask": 985,
  " track": 986,
  " odd": 987,
  " formula": 988,
  "14": 989,
  "ring": 990,
  "ile": 991,
  " those": 992,
  " cases": 993,
  " seems": 994,
  "low": 995,
  " <<": 996,
  "\n\n        ": 997,
  " integer": 998,
  " struct": 999,
  "eth": 1000,
  "ne": 1001,
  "ular": 1002,
  " result": 1003,
  " four": 1004,
  " connect": 1005,
  "If": 1006,
  "right": 1007,
  "ex": 1008,
  "pre": 1009,
  "fore": 1010,
  " constraints": 1011,
  " spec": 1012,
  "enc": 1013,
  "\n               ": 1014,
  " 20": 1015,
  " higher": 1016,
  "ify": 1017,
  "\n\n       ": 1018,
  " //": 1019,
  " mass": 1020,
  " neg": 1021,
  "\n\n      ": 1022,
  " size": 1023,
  " dis": 1024,
  " Th": 1025,
  "bin": 1026,
  "First": 1027,
  " field": 1028,
  "less": 1029,
  " also": 1030,
  " what": 1031,
  " permut": 1032,
  ")(": 1033,
  " conf": 1034,
  " yes": 1035,
  " sw": 1036,
  " cent": 1037,
  " processing": 1038,
  " V": 1039,
  "ption": 1040,
  " contain": 1041,
  " opt": 1042,
  "ry": 1043,
  " color": 1044,
  " least": 1045,
  "etic": 1046,
  "ordin": 1047,
  "ak": 1048,
  " inv": 1049,
  "xed": 1050,
  " 12": 1051,
  "\n\n     ": 1052,
  " U": 1053,
  " Hmm": 1054,
  " ind": 1055,
  " cir": 1056,
  "left": 1057,
  " side": 1058,
  " less": 1059,
  " doesn": 1060,
  " force": 1061,
  "ough": 1062,
  " required": 1063,
  "##": 1064,
  " parent": 1065,
  " ≈": 1066,
  " key": 1067,
  "bit": 1068,
  " before": 1069,
  "ward": 1070,
  " cells": 1071,
  "ird": 1072,
  " square": 1073,
  "verse": 1074,
  " del": 1075,
  " sing": 1076,
  "18": 1077,
  " hand": 1078,
  "loc": 1079,
  " kn": 1080,
  " moving": 1081,
  "ithm": 1082,
  "min": 1083,
  " stand": 1084,
  "cept": 1085,
  " That": 1086,
  "fin": 1087,
  "ice": 1088,
  "ub": 1089,
  "ail": 1090,
  " was": 1091,
  " remo": 1092,
  " ref": 1093,
  " calcul": 1094,
  "adi": 1095,
  "ither": 1096,
  "ick": 1097,
  "ok": 1098,
  " single": 1099,
  "cd": 1100,
  "prev": 1101,
  "ppose": 1102,
  "ire": 1103,
  "ines": 1104,
  " efficient": 1105,
  "asing": 1106,
  "boxed": 1107,
  "Another": 1108,
  " 100": 1109,
  " real": 1110,
  " area": 1111,
  " negative": 1112,
  "dered": 1113,
  " express": 1114,
  " ≤": 1115,
  "17": 1116,
  "po": 1117,
  " bu": 1118,
  "',": 1119,
  "ceed": 1120,
  " during": 1121,
  " des": 1122,
  " gr": 1123,
  " Which": 1124,
  " once": 1125,
  "mplement": 1126,
  " delta": 1127,
  " actual": 1128,
  "ons": 1129,
  "inc": 1130,
  " AB": 1131,
  " standard": 1132,
  " veloc": 1133,
  " times": 1134,
  " states": 1135,
  " fe": 1136,
  " \\).": 1137,
  " vari": 1138,
  " multiple": 1139,
  "imp": 1140,
  "24": 1141,
  "ract": 1142,
  " play": 1143,
  "anges": 1144,
  "count": 1145,
  " select": 1146,
  " lower": 1147,
  "aybe": 1148,
  "up": 1149,
  "led": 1150,
  "gn": 1151,
  "ty": 1152,
  " reg": 1153,
  "**:": 1154,
  " represent": 1155,
  "ory": 1156,
  " combin": 1157,
  "que": 1158,
  " choose": 1159,
  "()": 1160,
  "ross": 1161,
  " electron": 1162,
  " coordin": 1163,
  "ze": 1164,
  "hen": 1165,
  " requires": 1166,
  "++": 1167,
  " ...": 1168,
  " index": 1169,
  " allowed": 1170,
  " cor": 1171,
  " prop": 1172,
  "read": 1173,
  "ific": 1174,
  " operations": 1175,
  " rec": 1176,
  " include": 1177,
  " bo": 1178,
  "get": 1179,
  " difference": 1180,
  " oc": 1181,
  " triangle": 1182,
  " $": 1183,
  " den": 1184,
  " minimum": 1185,
  " large": 1186,
  "ject": 1187,
  "wise": 1188,
  "gg": 1189,
  "ead": 1190,
  " make": 1191,
  "cel": 1192,
  " dp": 1193,
  " rot": 1194,
  " >>": 1195,
  "100": 1196,
  " +=": 1197,
  " larger": 1198,
  " within": 1199,
  " car": 1200,
  " incorrect": 1201,
  " down": 1202,
  " fre": 1203,
  "ches": 1204,
  "kay": 1205,
  " velocity": 1206,
  " ho": 1207,
  " back": 1208,
  " why": 1209,
  " cre": 1210,
  " mid": 1211,
  "sec": 1212,
  " either": 1213,
  "no": 1214,
  "ane": 1215,
  " syst": 1216,
  " adjac": 1217,
  " speed": 1218,
  "ency": 1219,
  " Maybe": 1220,
  " ear": 1221,
  "--": 1222,
  " radi": 1223,
  "gor": 1224,
  "current": 1225,
  " cost": 1226,
  " \\(\\": 1227,
  " \\),": 1228,
  "ility": 1229,
  "ically": 1230,
  " Q": 1231,
  " adding": 1232,
  " integers": 1233,
  " lim": 1234,
  "dea": 1235,
  "inary": 1236,
  " comput": 1237,
  " entire": 1238,
  " comple": 1239,
  " deg": 1240,
  " sat": 1241,
  " permutation": 1242,
  "omin": 1243,
  "io": 1244,
  " No": 1245,
  " type": 1246,
  "itor": 1247,
  " leading": 1248,
  " prec": 1249,
  " occur": 1250,
  " und": 1251,
  " just": 1252,
  " whether": 1253,
  "row": 1254,
  " third": 1255,
  " digit": 1256,
  "atic": 1257,
  "isf": 1258,
  " starting": 1259,
  "gorithm": 1260,
  " cand": 1261,
  " try": 1262,
  "utive": 1263,
  " structure": 1264,
  " partic": 1265,
  "oriz": 1266,
  "'m": 1267,
  "secutive": 1268,
  "ia": 1269,
  "ities": 1270,
  " used": 1271,
  " sides": 1272,
  " gre": 1273,
  " Each": 1274,
  " satisf": 1275,
  ".,": 1276,
  "side": 1277,
  "impl": 1278,
  " √": 1279,
  "sign": 1280,
  " bre": 1281,
  " determin": 1282,
  "which": 1283,
  "ten": 1284,
  "tc": 1285,
  " ins": 1286,
  "ential": 1287,
  ")/(": 1288,
  " connected": 1289,
  " graph": 1290,
  " constant": 1291,
  " present": 1292,
  " invol": 1293,
  " isn": 1294,
  "ational": 1295,
  "based": 1296,
  "orm": 1297,
  " cycle": 1298,
  "bab": 1299,
  "lf": 1300,
  " added": 1301,
  "und": 1302,
  "\\).": 1303,
  " bl": 1304,
  " algorithm": 1305,
  "33": 1306,
  "gr": 1307,
  "otal": 1308,
  "rees": 1309,
  "action": 1310,
  " characters": 1311,
  " consecutive": 1312,
  "like": 1313,
  " being": 1314,
  " sure": 1315,
  " etc": 1316,
  "ents": 1317,
  " assign": 1318,
  "ossible": 1319,
  " implement": 1320,
  "valid": 1321,
  "ized": 1322,
  " log": 1323,
  "pl": 1324,
  "},": 1325,
  "loor": 1326,
  " light": 1327,
  " Not": 1328,
  "ertain": 1329,
  " Alternatively": 1330,
  " der": 1331,
  " intervals": 1332,
  "lied": 1333,
  " variable": 1334,
  " system": 1335,
  "ins": 1336,
  " comm": 1337,
  "cos": 1338,
  "$$$.": 1339,
  " magn": 1340,
  " pass": 1341,
  " certain": 1342,
  " earli": 1343,
  "ys": 1344,
  "itions": 1345,
  " considering": 1346,
  " redu": 1347,
  " binary": 1348,
  " children": 1349,
  " ob": 1350,
  " many": 1351,
  " optimal": 1352,
  "50": 1353,
  " matches": 1354,
  "arr": 1355,
  "nce": 1356,
  "19": 1357,
  " sur": 1358,
  " statement": 1359,
  " change": 1360,
  "OR": 1361,
  " candid": 1362,
  " subtree": 1363,
  " without": 1364,
  "ures": 1365,
  "celer": 1366,
  " conditions": 1367,
  "pend": 1368,
  " exponent": 1369,
  " processed": 1370,
  " merg": 1371,
  "mpty": 1372,
  "orizon": 1373,
  " found": 1374,
  "agon": 1375,
  " ++": 1376,
  " len": 1377,
  "ready": 1378,
  "ided": 1379,
  " cnt": 1380,
  " met": 1381,
  "uppose": 1382,
  " don": 1383,
  " cin": 1384,
  "round": 1385,
  " substit": 1386,
  " prime": 1387,
  "par": 1388,
  "ake": 1389,
  " &": 1390,
  " adjacent": 1391,
  "Hmm": 1392,
  "ale": 1393,
  "ost": 1394,
  " !": 1395,
  "ied": 1396,
  " pot": 1397,
  " 16": 1398,
  " say": 1399,
  " probab": 1400,
  " vol": 1401,
  " reach": 1402,
  " segments": 1403,
  " charge": 1404,
  " hy": 1405,
  " lines": 1406,
  " av": 1407,
  " operation": 1408,
  " solutions": 1409,
  " most": 1410,
  " under": 1411,
  " press": 1412,
  " 11": 1413,
  "</": 1414,
  " already": 1415,
  "aw": 1416,
  "asible": 1417,
  " Similarly": 1418,
  " id": 1419,
  "als": 1420,
  "vel": 1421,
  " #": 1422,
  "amet": 1423,
  "ggest": 1424,
  " suggest": 1425,
  " bits": 1426,
  " affect": 1427,
  "Okay": 1428,
  " largest": 1429,
  " deriv": 1430,
  "from": 1431,
  "sin": 1432,
  " fl": 1433,
  "\\[": 1434,
  " feasible": 1435,
  "ature": 1436,
  " 25": 1437,
  " exists": 1438,
  " interse": 1439,
  " ver": 1440,
  " uni": 1441,
  " lea": 1442,
  "       ": 1443,
  " acceler": 1444,
  " final": 1445,
  " allows": 1446,
  "itorial": 1447,
  "here": 1448,
  " XOR": 1449,
  " horizon": 1450,
  " !=": 1451,
  "kes": 1452,
  " true": 1453,
  " counts": 1454,
  " along": 1455,
  "inct": 1456,
  " frequ": 1457,
  " temp": 1458,
  " contains": 1459,
  "We": 1460,
  " moment": 1461,
  " starts": 1462,
  "size": 1463,
  " base": 1464,
  " limit": 1465,
  " best": 1466,
  " rat": 1467,
  " impossible": 1468,
  "hed": 1469,
  "ep": 1470,
  " abs": 1471,
  "}.": 1472,
  "ian": 1473,
  "alse": 1474,
  "$$$,": 1475,
  " factor": 1476,
  " center": 1477,
  "iven": 1478,
  "con": 1479,
  "utes": 1480,
  " based": 1481,
  "ush": 1482,
  " decre": 1483,
  " assum": 1484,
  "let": 1485,
  "sib": 1486,
  " potential": 1487,
  "30": 1488,
  " efficiently": 1489,
  "adr": 1490,
  " contribution": 1491,
  "rocess": 1492,
  " still": 1493,
  " distinct": 1494,
  " groups": 1495,
  " grav": 1496,
  "mmet": 1497,
  "36": 1498,
  ")*": 1499,
  " require": 1500,
  "gen": 1501,
  " components": 1502,
  " proceed": 1503,
  " am": 1504,
  " depth": 1505,
  " ]": 1506,
  " break": 1507,
  " sign": 1508,
  "pond": 1509,
  " substring": 1510,
  " inst": 1511,
  "ixed": 1512,
  " day": 1513,
  "text": 1514,
  "attern": 1515,
  "ib": 1516,
  "yn": 1517,
  "arget": 1518,
  " coordinates": 1519,
  " effect": 1520,
  "ear": 1521,
  " 18": 1522,
  "ral": 1523,
  " quadr": 1524,
  " depends": 1525,
  " plus": 1526,
  "])": 1527,
  " 15": 1528,
  "ding": 1529,
  " main": 1530,
  " %": 1531,
  " due": 1532,
  "];": 1533,
  "ced": 1534,
  "xis": 1535,
  "\".": 1536,
  "respond": 1537,
  "ething": 1538,
  " pressure": 1539,
  "ull": 1540,
  "allest": 1541,
  " determined": 1542,
  "pper": 1543,
  " wind": 1544,
  " grid": 1545,
  " cross": 1546,
  " sums": 1547,
  " correspond": 1548,
  " :": 1549,
  " contin": 1550,
  " vertical": 1551,
  " invalid": 1552,
  " while": 1553,
  "log": 1554,
  " divisible": 1555,
  "ailable": 1556,
  "\\]": 1557,
  "mat": 1558,
  " water": 1559,
  " considered": 1560,
  "\\),": 1561,
  " editorial": 1562,
  " pattern": 1563,
  "ming": 1564,
  " high": 1565,
  " works": 1566,
  " trip": 1567,
  " indices": 1568,
  "ppos": 1569,
  " rest": 1570,
  " needed": 1571,
  " run": 1572,
  " mem": 1573,
  " rect": 1574,
  "(-": 1575,
  "\n\n          ": 1576,
  " determine": 1577,
  " level": 1578,
  "cdot": 1579,
  " equations": 1580,
  "Option": 1581,
  " handle": 1582,
  "Similarly": 1583,
  " know": 1584,
  " upd": 1585,
  "using": 1586,
  " resi": 1587,
  "di": 1588,
  " smaller": 1589,
  " hal": 1590,
  "ffix": 1591,
  " increases": 1592,
  " follows": 1593,
  " horizontal": 1594,
  " smallest": 1595,
  " something": 1596,
  " suggests": 1597,
  "aps": 1598,
  " read": 1599,
  " BC": 1600,
  " chain": 1601,
  " DP": 1602,
  "hat": 1603,
  " your": 1604,
  "not": 1605,
  " desc": 1606,
  " π": 1607,
  " wave": 1608,
  " LC": 1609,
  " conc": 1610,
  "21": 1611,
  " vis": 1612,
  "ext": 1613,
  "ics": 1614,
  "sive": 1615,
  " hold": 1616,
  "ata": 1617,
  " Thus": 1618,
  "'.": 1619,
  "per": 1620,
  "40": 1621,
  "\n\n           ": 1622,
  " reverse": 1623,
  " parts": 1624,
  " subse": 1625,
  " target": 1626,
  " floor": 1627,
  " around": 1628,
  " possib": 1629,
  " ca": 1630,
  " primes": 1631,
  " surf": 1632,
  " We": 1633,
  "xy": 1634,
  " Compute": 1635,
  " J": 1636,
  " br": 1637,
  " vertex": 1638,
  " common": 1639,
  " Check": 1640,
  "usion": 1641,
  " symmet": 1642,
  " top": 1643,
  "pr": 1644,
  "ven": 1645,
  " θ": 1646,
  "{\\": 1647,
  "length": 1648,
  " write": 1649,
  " resp": 1650,
  "itten": 1651,
  "\",": 1652,
  "ict": 1653,
  " ≥": 1654,
  "arch": 1655,
  "ments": 1656,
  " includes": 1657,
  "gram": 1658,
  " mean": 1659,
  " fr": 1660,
  " generate": 1661,
  " circle": 1662,
  "pa": 1663,
  " window": 1664,
  " poly": 1665,
  " apply": 1666,
  "ark": 1667,
  " weight": 1668,
  "efficient": 1669,
  "ings": 1670,
  " though": 1671,
  " revers": 1672,
  " ens": 1673,
  " expression": 1674,
  " look": 1675,
  "inclu": 1676,
  " An": 1677,
  " reas": 1678,
  "60": 1679,
  " Or": 1680,
  " idea": 1681,
  "75": 1682,
  " vertices": 1683,
  "aced": 1684,
  "28": 1685,
  " subtract": 1686,
  "64": 1687,
  "ouble": 1688,
  " queries": 1689,
  " mask": 1690,
  "OD": 1691,
  " cout": 1692,
  " arrange": 1693,
  " swap": 1694,
  " our": 1695,
  "}}": 1696,
  " moves": 1697,
  " overl": 1698,
  " fixed": 1699,
  " space": 1700,
  " loop": 1701,
  "ormal": 1702,
  " frequency": 1703,
  " diagon": 1704,
  "xim": 1705,
  " object": 1706,
  " degrees": 1707,
  "Yes": 1708,
  " reason": 1709,
  " electrons": 1710,
  "node": 1711,
  " variables": 1712,
  " hel": 1713,
  " recall": 1714,
  "el": 1715,
  "ruct": 1716,
  " specific": 1717,
  " done": 1718,
  " unique": 1719,
  "ensity": 1720,
  " general": 1721,
  "iss": 1722,
  " When": 1723,
  "raction": 1724,
  " bal": 1725,
  "uting": 1726,
  "very": 1727,
  "CD": 1728,
  " similar": 1729,
  " build": 1730,
  "pha": 1731,
  "ift": 1732,
  " rows": 1733,
  " red": 1734,
  " surface": 1735,
  " data": 1736,
  " height": 1737,
  "back": 1738,
  " typ": 1739,
  " phot": 1740,
  " stu": 1741,
  " merged": 1742,
  " inside": 1743,
  " available": 1744,
  " iter": 1745,
  " computed": 1746,
  "part": 1747,
  " coefficient": 1748,
  " too": 1749,
  " half": 1750,
  "rix": 1751,
  " columns": 1752,
  "new": 1753,
  " cap": 1754,
  " bond": 1755,
  " radius": 1756,
  "ton": 1757,
  ")]": 1758,
  "32": 1759,
  " 14": 1760,
  "enari": 1761,
  "ominator": 1762,
  " greater": 1763,
  "Compute": 1764,
  " prov": 1765,
  " factors": 1766,
  " better": 1767,
  "ters": 1768,
  " Hence": 1769,
  "=-": 1770,
  " actually": 1771,
  " transform": 1772,
  "start": 1773,
  " parity": 1774,
  " mu": 1775,
  " separ": 1776,
  " approxim": 1777,
  " double": 1778,
  " MOD": 1779,
  "ately": 1780,
  " 13": 1781,
  " empty": 1782,
  " expect": 1783,
  " increasing": 1784,
  "Given": 1785,
  "equ": 1786,
  " candidate": 1787,
  " suffix": 1788,
  "len": 1789,
  " via": 1790,
  " cover": 1791,
  " meas": 1792,
  "22": 1793,
  " colors": 1794,
  " changes": 1795,
  " collect": 1796,
  " scenari": 1797,
  "cu": 1798,
  " divided": 1799,
  " oppos": 1800,
  " acceleration": 1801,
  " acid": 1802,
  " reaction": 1803,
  "bser": 1804,
  "dig": 1805,
  " written": 1806,
  " quant": 1807,
  " power": 1808,
  " every": 1809,
  "anged": 1810,
  " mist": 1811,
  " necess": 1812,
  "Alternative": 1813,
  " ratio": 1814,
  " satisfy": 1815,
  "ternal": 1816,
  "apping": 1817,
  "cles": 1818,
  " match": 1819,
  " precompute": 1820,
  " earlier": 1821,
  " momentum": 1822,
  " program": 1823,
  " bound": 1824,
  " temper": 1825,
  "co": 1826,
  "27": 1827,
  "ner": 1828,
  " turn": 1829,
  "ES": 1830,
  " complic": 1831,
  " meth": 1832,
  " complex": 1833,
  " ext": 1834,
  "itional": 1835,
  "\n                   ": 1836,
  "ho": 1837,
  "to": 1838,
  " ident": 1839,
  "av": 1840,
  "rences": 1841,
  " ≡": 1842,
  "self": 1843,
  " roots": 1844,
  " expl": 1845,
  "\\(": 1846,
  "ctors": 1847,
  " multiplied": 1848,
  " squares": 1849,
  " obser": 1850,
  " α": 1851,
  " subsequ": 1852,
  "rem": 1853,
  " now": 1854,
  " ways": 1855,
  "ames": 1856,
  "imize": 1857,
  "ume": 1858,
  " Suppose": 1859,
  " fig": 1860,
  " upper": 1861,
  " search": 1862,
  " =>": 1863,
  " remains": 1864,
  " days": 1865,
  "^{-": 1866,
  "eros": 1867,
  " defin": 1868,
  "pi": 1869,
  " uses": 1870,
  "lies": 1871,
  " unless": 1872,
  " black": 1873,
  "23": 1874,
  " low": 1875,
  "tr": 1876,
  "ending": 1877,
  "itu": 1878,
  "are": 1879,
  "ynam": 1880,
  " 50": 1881,
  " mot": 1882,
  " manage": 1883,
  "ug": 1884,
  "ots": 1885,
  "ess": 1886,
  "aches": 1887,
  "dro": 1888,
  " atom": 1889,
  " directly": 1890,
  " ...,": 1891,
  "dp": 1892,
  "times": 1893,
  "time": 1894,
  " opposite": 1895,
  " above": 1896,
  " sour": 1897,
  " cr": 1898,
  " Al": 1899,
  "ization": 1900,
  " cur": 1901,
  "ified": 1902,
  "theta": 1903,
  " flow": 1904,
  " modul": 1905,
  "edi": 1906,
  "oking": 1907,
  "sc": 1908,
  "ways": 1909,
  "input": 1910,
  " she": 1911,
  " mole": 1912,
  "ember": 1913,
  " create": 1914,
  " stack": 1915,
  "ension": 1916,
  "therwise": 1917,
  " solve": 1918,
  "ivale": 1919,
  " Correct": 1920,
  " mistake": 1921,
  "zero": 1922,
  " linear": 1923,
  " infin": 1924,
  " correctly": 1925,
  "total": 1926,
  " simpl": 1927,
  " matrix": 1928,
  "oid": 1929,
  "line": 1930,
  " my": 1931,
  "To": 1932,
  " frame": 1933,
  " normal": 1934,
  "66": 1935,
  " Yes": 1936,
  "ded": 1937,
  " Now": 1938,
  " zeros": 1939,
  " att": 1940,
  " equivale": 1941,
  " adjust": 1942,
  " magnetic": 1943,
  "riction": 1944,
  " 30": 1945,
  " sha": 1946,
  "ored": 1947,
  "onst": 1948,
  " density": 1949,
  "gin": 1950,
  " programming": 1951,
  " AC": 1952,
  " perform": 1953,
  " transitions": 1954,
  "wards": 1955,
  " 200": 1956,
  " contributes": 1957,
  "osen": 1958,
  " 19": 1959,
  "utput": 1960,
  "48": 1961,
  "array": 1962,
  "35": 1963,
  " remember": 1964,
  "ativ": 1965,
  " tan": 1966,
  " To": 1967,
  " It": 1968,
  " wrong": 1969,
  " selected": 1970,
  " diff": 1971,
  " chosen": 1972,
  "erator": 1973,
  " intersection": 1974,
  "with": 1975,
  " plane": 1976,
  " help": 1977,
  "vered": 1978,
  "yl": 1979,
  "\n\n         ": 1980,
  " ranges": 1981,
  " memory": 1982,
  " vectors": 1983,
  "ighb": 1984,
  "vert": 1985,
  " rectangle": 1986,
  " ×": 1987,
  "ob": 1988,
  " temperature": 1989,
  "col": 1990,
  " volume": 1991,
  " following": 1992,
  " repl": 1993,
  " ones": 1994,
  " player": 1995,
  " denominator": 1996,
  " place": 1997,
  "ks": 1998,
  " ce": 1999,
  " units": 2000,
  "FS": 2001,
  "\n\n                    ": 2002,
  " unit": 2003,
  " derivative": 2004,
  "lection": 2005,
  " continue": 2006,
  "Read": 2007,
  " needs": 2008,
  "cl": 2009,
  " subsets": 2010,
  "omet": 2011,
  " note": 2012,
  " heat": 2013,
  "ited": 2014,
  " plan": 2015,
  "ences": 2016,
  "200": 2017,
  " figure": 2018,
  " except": 2019,
  "ameter": 2020,
  "mod": 2021,
  "rop": 2022,
  "push": 2023,
  " coll": 2024,
  " phase": 2025,
  "aces": 2026,
  " ball": 2027,
  "ror": 2028,
  " 24": 2029,
  " electric": 2030,
  "sp": 2031,
  "aining": 2032,
  "aly": 2033,
  "cre": 2034,
  "ote": 2035,
  " multiply": 2036,
  " clos": 2037,
  " el": 2038,
  "arth": 2039,
  "equal": 2040,
  " leaves": 2041,
  " reduces": 2042,
  " divisors": 2043,
  "ually": 2044,
  " ima": 2045,
  "num": 2046,
  "Which": 2047,
  " false": 2048,
  " la": 2049,
  "ken": 2050,
  "raight": 2051,
  " conduct": 2052,
  " paths": 2053,
  "'re": 2054,
  " getting": 2055,
  " map": 2056,
  " reversed": 2057,
  "45": 2058,
  " Otherwise": 2059,
  "lice": 2060,
  "angles": 2061,
  " neighb": 2062,
  " implementation": 2063,
  " sl": 2064,
  " scenario": 2065,
  " remove": 2066,
  " equals": 2067,
  " ment": 2068,
  " ans": 2069,
  " angles": 2070,
  "leq": 2071,
  " accept": 2072,
  " manageable": 2073,
  " orbit": 2074,
  "std": 2075,
  "uous": 2076,
  "suming": 2077,
  " always": 2078,
  "})": 2079,
  "ardless": 2080,
  "imin": 2081,
  " card": 2082,
  "neg": 2083,
  " much": 2084,
  "itational": 2085,
  " phys": 2086,
  " hydro": 2087,
  "digit": 2088,
  "hest": 2089,
  " quadratic": 2090,
  " spin": 2091,
  " print": 2092,
  "ntil": 2093,
  "ning": 2094,
  " Sum": 2095,
  " cannot": 2096,
  "80": 2097,
  " give": 2098,
  " were": 2099,
  " itself": 2100,
  " until": 2101,
  " means": 2102,
  "wn": 2103,
  "point": 2104,
  "ense": 2105,
  " GCD": 2106,
  "math": 2107,
  "Sample": 2108,
  " happ": 2109,
  " covered": 2110,
  "include": 2111,
  "imized": 2112,
  " equivalent": 2113,
  " making": 2114,
  "icular": 2115,
  "output": 2116,
  "vector": 2117,
  " ?": 2118,
  " motion": 2119,
  "pendicular": 2120,
  " made": 2121,
  " free": 2122,
  "Check": 2123,
  " regardless": 2124,
  "ling": 2125,
  " formed": 2126,
  " very": 2127,
  " makes": 2128,
  "ets": 2129,
  "yth": 2130,
  "ere": 2131,
  " Earth": 2132,
  " complicated": 2133,
  " recur": 2134,
  " pe": 2135,
  "over": 2136,
  " ceil": 2137,
  "axis": 2138,
  " fli": 2139,
  "clu": 2140,
  "begin": 2141,
  " consist": 2142,
  "();": 2143,
  "ances": 2144,
  " exceed": 2145,
  "70": 2146,
  " dynam": 2147,
  " respect": 2148,
  "rad": 2149,
  "98": 2150,
  "ism": 2151,
  "ilities": 2152,
  " triplet": 2153,
  "Ah": 2154,
  " ach": 2155,
  "fect": 2156,
  " straight": 2157,
  " inequal": 2158,
  " probability": 2159,
  " Output": 2160,
  " update": 2161,
  "(),": 2162,
  " bott": 2163,
  " 60": 2164,
  "but": 2165,
  " stud": 2166,
  " achie": 2167,
  " blocks": 2168,
  "mask": 2169,
  " angular": 2170,
  "lar": 2171,
  " bas": 2172,
  " contribute": 2173,
  "bon": 2174,
  " er": 2175,
  " diagonal": 2176,
  " placed": 2177,
  "44": 2178,
  "chan": 2179,
  "uto": 2180,
  " perpendicular": 2181,
  " method": 2182,
  " gravitational": 2183,
  "90": 2184,
  " quantum": 2185,
  " others": 2186,
  " choices": 2187,
  " round": 2188,
  "orted": 2189,
  "°,": 2190,
  " Z": 2191,
  " LCA": 2192,
  " fil": 2193,
  " Format": 2194,
  " ser": 2195,
  " shift": 2196,
  " word": 2197,
  " minus": 2198,
  " nu": 2199,
  " seconds": 2200,
  " dim": 2201,
  " particles": 2202,
  "iod": 2203,
  " conve": 2204,
  " removed": 2205,
  "ired": 2206,
  " want": 2207,
  " been": 2208,
  " finding": 2209,
  "}\\": 2210,
  " air": 2211,
  " checking": 2212,
  "pping": 2213,
  " tang": 2214,
  " good": 2215,
  "den": 2216,
  " los": 2217,
  " rotation": 2218,
  " Ex": 2219,
  " sk": 2220,
  " complete": 2221,
  " NO": 2222,
  " calculation": 2223,
  " 1000": 2224,
  " ⇒": 2225,
  " forces": 2226,
  " Pro": 2227,
  " appear": 2228,
  "*(-": 2229,
  " dele": 2230,
  " friction": 2231,
  "26": 2232,
  " ($$$": 2233,
  " insert": 2234,
  " balance": 2235,
  " class": 2236,
  " What": 2237,
  "anging": 2238,
  "prime": 2239,
  "prefix": 2240,
  " ±": 2241,
  " known": 2242,
  "original": 2243,
  " sense": 2244,
  " divides": 2245,
  " paralle": 2246,
  " mechan": 2247,
  " propert": 2248,
  " ab": 2249,
  "ful": 2250,
  " modulo": 2251,
  " box": 2252,
  " Idea": 2253,
  " ω": 2254,
  " St": 2255,
  " ends": 2256,
  " movement": 2257,
  " additional": 2258,
  "ateg": 2259,
  "29": 2260,
  " off": 2261,
  " \\]": 2262,
  "sub": 2263,
  " combination": 2264,
  "even": 2265,
  " subarray": 2266,
  " implies": 2267,
  "ython": 2268,
  "ural": 2269,
  "ultiply": 2270,
  "=(": 2271,
  "econd": 2272,
  "gon": 2273,
  "49": 2274,
  "most": 2275,
  " suppose": 2276,
  "After": 2277,
  " 17": 2278,
  " law": 2279,
  " relative": 2280,
  " Alice": 2281,
  " coordinate": 2282,
  "dle": 2283,
  " 90": 2284,
  " contrad": 2285,
  " acceptable": 2286,
  " period": 2287,
  " que": 2288,
  "anding": 2289,
  " team": 2290,
  "omial": 2291,
  " verify": 2292,
  "^(": 2293,
  " nucle": 2294,
  " displ": 2295,
  " context": 2296,
  " increase": 2297,
  "Each": 2298,
  " particle": 2299,
  " white": 2300,
  " related": 2301,
  "erhaps": 2302,
  " permutations": 2303,
  " Bob": 2304,
  " neut": 2305,
  "}^": 2306,
  " YES": 2307,
  " dra": 2308,
  "ended": 2309,
  " approaches": 2310,
  " enough": 2311,
  "initial": 2312,
  "]=": 2313,
  " Find": 2314,
  "pendent": 2315,
  "ube": 2316,
  "itude": 2317,
  "alpha": 2318,
  " lay": 2319,
  " denote": 2320,
  " blue": 2321,
  " occurrence": 2322,
  " numerator": 2323,
  "//": 2324,
  "bal": 2325,
  "55": 2326,
  "aves": 2327,
  "arily": 2328,
  "itialize": 2329,
  " gas": 2330,
  " game": 2331,
  "erge": 2332,
  "child": 2333,
  "())": 2334,
  " win": 2335,
  "cy": 2336,
  " resid": 2337,
  "rm": 2338,
  " highest": 2339,
  "verage": 2340,
  " probably": 2341,
  " resist": 2342,
  " distrib": 2343,
  " ln": 2344,
  "agn": 2345,
  " gravity": 2346,
  " sets": 2347,
  "ortion": 2348,
  "cal": 2349,
  " Add": 2350,
  " followed": 2351,
  "\n\n              ": 2352,
  " takes": 2353,
  "\n                    ": 2354,
  " 40": 2355,
  " transition": 2356,
  "da": 2357,
  " molecu": 2358,
  " Li": 2359,
  "acement": 2360,
  "}\\)": 2361,
  " miss": 2362,
  " construct": 2363,
  "cular": 2364,
  "pair": 2365,
  "points": 2366,
  " confir": 2367,
  " task": 2368,
  "way": 2369,
  " earliest": 2370,
  " β": 2371,
  "olute": 2372,
  "76": 2373,
  " measure": 2374,
  "(\\": 2375,
  "ators": 2376,
  "idden": 2377,
  " divide": 2378,
  "where": 2379,
  " symmetry": 2380,
  " mater": 2381,
  " arranged": 2382,
  "pro": 2383,
  "ront": 2384,
  " tra": 2385,
  "')": 2386,
  " likely": 2387,
  "Final": 2388,
  " asking": 2389,
  " equil": 2390,
  "negative": 2391,
  " applied": 2392,
  " comes": 2393,
  " sequences": 2394,
  " swaps": 2395,
  "amb": 2396,
  " indeed": 2397,
  " dynamic": 2398,
  " &&": 2399,
  "ateral": 2400,
  " show": 2401,
  " em": 2402,
  " intersect": 2403,
  " material": 2404,
  " fraction": 2405,
  " Also": 2406,
  " remainder": 2407,
  " ant": 2408,
  " structures": 2409,
  " names": 2410,
  " event": 2411,
  "Case": 2412,
  " among": 2413,
  "son": 2414,
  " existing": 2415,
  "izes": 2416,
  "Once": 2417,
  " exponents": 2418,
  " convex": 2419,
  " own": 2420,
  " across": 2421,
  " strong": 2422,
  " strateg": 2423,
  "0000": 2424,
  "process": 2425,
  "case": 2426,
  "}^{": 2427,
  " queue": 2428,
  " coefficients": 2429,
  " absolute": 2430,
  "ration": 2431,
  " reality": 2432,
  "hile": 2433,
  " BFS": 2434,
  " strings": 2435,
  " none": 2436,
  " Δ": 2437,
  " middle": 2438,
  " ensure": 2439,
  " dx": 2440,
  " spl": 2441,
  "\n\n               ": 2442,
  "idx": 2443,
  " possibilities": 2444,
  "inetic": 2445,
  " inequality": 2446,
  " All": 2447,
  " approximately": 2448,
  " pres": 2449,
  " ge": 2450,
  " flu": 2451,
  "Suppose": 2452,
  " Option": 2453,
  " adds": 2454,
  " stre": 2455,
  "bits": 2456,
  "mu": 2457,
  " occurs": 2458,
  " maint": 2459,
  " produ": 2460,
  " cut": 2461,
  "la": 2462,
  "lope": 2463,
  ")).": 2464,
  " involves": 2465,
  "Second": 2466,
  " And": 2467,
  "used": 2468,
  " source": 2469,
  "dist": 2470,
  " AD": 2471,
  "AB": 2472,
  " average": 2473,
  " confirm": 2474,
  " players": 2475,
  "atural": 2476,
  " std": 2477,
  "ilt": 2478,
  " splits": 2479,
  " wins": 2480,
  "vation": 2481,
  " λ": 2482,
  " events": 2483,
  " theore": 2484,
  " φ": 2485,
  " functions": 2486,
  "Cl": 2487,
  "cpp": 2488,
  "Process": 2489,
  "ysis": 2490,
  "sorted": 2491,
  "ivid": 2492,
  " axis": 2493,
  "iction": 2494,
  " parallel": 2495,
  " charges": 2496,
  "cent": 2497,
  "No": 2498,
  " gcd": 2499,
  "bidden": 2500,
  " strategy": 2501,
  " Answer": 2502,
  " bottom": 2503,
  "number": 2504,
  "34": 2505,
  " compet": 2506,
  " After": 2507,
  "From": 2508,
  ">>": 2509,
  " def": 2510,
  " crit": 2511,
  " visited": 2512,
  " fields": 2513,
  " interaction": 2514,
  "ats": 2515,
  "sing": 2516,
  " carbon": 2517,
  "alysis": 2518,
  " Input": 2519,
  " Tr": 2520,
  " arc": 2521,
  "}}{": 2522,
  " calculate": 2523,
  "ambda": 2524,
  " leads": 2525,
  " arrays": 2526,
  "ste": 2527,
  " kinetic": 2528,
  "riend": 2529,
  "ries": 2530,
  " gu": 2531,
  " directions": 2532,
  " cm": 2533,
  " letters": 2534,
  "ision": 2535,
  "roup": 2536,
  "ci": 2537,
  "ish": 2538,
  " had": 2539,
  " cube": 2540,
  "pace": 2541,
  " overlapping": 2542,
  "NO": 2543,
  " km": 2544,
  "ls": 2545,
  "Since": 2546,
  " lengths": 2547,
  "inde": 2548,
  " mir": 2549,
  "Lo": 2550,
  " scal": 2551,
  " integral": 2552,
  " natural": 2553,
  "->": 2554,
  " candidates": 2555,
  " degree": 2556,
  " external": 2557,
  " arrangement": 2558,
  " instead": 2559,
  "At": 2560,
  "gs": 2561,
  ".\"": 2562,
  " longer": 2563,
  " cycles": 2564,
  "31": 2565,
  " provide": 2566,
  " CD": 2567,
  " keep": 2568,
  " involve": 2569,
  " Else": 2570,
  "tage": 2571,
  " differences": 2572,
  "eta": 2573,
  "ya": 2574,
  " ru": 2575,
  "1000": 2576,
  " vs": 2577,
  " towards": 2578,
  "oint": 2579,
  " tens": 2580,
  " user": 2581,
  "fe": 2582,
  " separate": 2583,
  "iguous": 2584,
  " sto": 2585,
  " rate": 2586,
  " 36": 2587,
  " vary": 2588,
  " runs": 2589,
  "ars": 2590,
  " including": 2591,
  " face": 2592,
  "ifies": 2593,
  "ptr": 2594,
  "rior": 2595,
  " compos": 2596,
  "ser": 2597,
  "nomial": 2598,
  " thought": 2599,
  ")*(": 2600,
  "andid": 2601,
  "999": 2602,
  " You": 2603,
  " mark": 2604,
  " pick": 2605,
  " merge": 2606,
  " ox": 2607,
  " Con": 2608,
  " answers": 2609,
  "map": 2610,
  "etimes": 2611,
  " \\[": 2612,
  " corresponds": 2613,
  " subsequence": 2614,
  " proportion": 2615,
  " hash": 2616,
  " explain": 2617,
  "}\\).": 2618,
  " indic": 2619,
  " sufficient": 2620,
  "gether": 2621,
  " polynomial": 2622,
  " prim": 2623,
  " necessary": 2624,
  " outside": 2625,
  "mon": 2626,
  "implify": 2627,
  " cause": 2628,
  " geomet": 2629,
  "empty": 2630,
  "';": 2631,
  " absor": 2632,
  " theta": 2633,
  " paramet": 2634,
  " Pre": 2635,
  " increment": 2636,
  " exper": 2637,
  " divisor": 2638,
  " holds": 2639,
  "pped": 2640,
  "hem": 2641,
  " squared": 2642,
  "cost": 2643,
  " choos": 2644,
  " represents": 2645,
  "96": 2646,
  " cards": 2647,
  "alyze": 2648,
  "formation": 2649,
  "37": 2650,
  " fourth": 2651,
  "lease": 2652,
  "odd": 2653,
  "01": 2654,
  "after": 2655,
  " individ": 2656,
  "iding": 2657,
  " together": 2658,
  " did": 2659,
  " critical": 2660,
  " altern": 2661,
  " Ne": 2662,
  " net": 2663,
  " modified": 2664,
  " his": 2665,
  " big": 2666,
  " ordered": 2667,
  "ump": 2668,
  " slow": 2669,
  " calculated": 2670,
  "compute": 2671,
  " well": 2672,
  " included": 2673,
  "candid": 2674,
  " Python": 2675,
  " represented": 2676,
  " $\\": 2677,
  " Like": 2678,
  " refer": 2679,
  " assigned": 2680,
  " applying": 2681,
  " choice": 2682,
  " capac": 2683,
  "order": 2684,
  " namespace": 2685,
  " affects": 2686,
  " —": 2687,
  "amma": 2688,
  "cial": 2689,
  " matter": 2690,
  "ij": 2691,
  " align": 2692,
  " challe": 2693,
  " voltage": 2694,
  "long": 2695,
  " displacement": 2696,
  " basis": 2697,
  " maximize": 2698,
  "\n\n                ": 2699,
  " concent": 2700,
  " friend": 2701,
  " domin": 2702,
  "cnt": 2703,
  " photon": 2704,
  "igur": 2705,
  "aa": 2706,
  " instance": 2707,
  " building": 2708,
  " atoms": 2709,
  " built": 2710,
  "ele": 2711,
  " coins": 2712,
  " twice": 2713,
  "list": 2714,
  " sometimes": 2715,
  " decreases": 2716,
  " oxy": 2717,
  " returns": 2718,
  "ness": 2719,
  " refers": 2720,
  " iterate": 2721,
  "uted": 2722,
  "mo": 2723,
  " perfect": 2724,
  " necessarily": 2725,
  " filled": 2726,
  " elimin": 2727,
  " configur": 2728,
  " conser": 2729,
  " mis": 2730,
  " invers": 2731,
  "ted": 2732,
  "uplic": 2733,
  " usually": 2734,
  "ax": 2735,
  " taken": 2736,
  "ured": 2737,
  " bod": 2738,
  " person": 2739,
  " ABC": 2740,
  " diameter": 2741,
  " five": 2742,
  "tree": 2743,
  " overlap": 2744,
  "delta": 2745,
  "remaining": 2746,
  " account": 2747,
  "56": 2748,
  " tangent": 2749,
  "ively": 2750,
  " 32": 2751,
  " combinations": 2752,
  "incip": 2753,
  " theory": 2754,
  " ε": 2755,
  " happen": 2756,
  "cir": 2757,
  " mon": 2758,
  "diff": 2759,
  "const": 2760,
  " exclu": 2761,
  "first": 2762,
  "yond": 2763,
  " corresponding": 2764,
  " ai": 2765,
  " substituting": 2766,
  "air": 2767,
  "++.": 2768,
  "38": 2769,
  " inf": 2770,
  " multiples": 2771,
  "index": 2772,
  " front": 2773,
  "Because": 2774,
  " operator": 2775,
  " depending": 2776,
  "$$$)": 2777,
  " taking": 2778,
  " sem": 2779,
  " waves": 2780,
  "rip": 2781,
  "dt": 2782,
  " forbidden": 2783,
  " Oh": 2784,
  " merging": 2785,
  " cle": 2786,
  " hence": 2787,
  " flip": 2788,
  " beyond": 2789,
  "Or": 2790,
  "comp": 2791,
  " 45": 2792,
  " LCM": 2793,
  "78": 2794,
  "cest": 2795,
  "?),": 2796,
  " inverse": 2797,
  "inter": 2798,
  " sound": 2799,
  " passes": 2800,
  " react": 2801,
  ")),": 2802,
  " \\):": 2803,
  " resulting": 2804,
  " ^": 2805,
  " vers": 2806,
  " Un": 2807,
  " triangles": 2808,
  " generating": 2809,
  " products": 2810,
  "Multiply": 2811,
  " ancest": 2812,
  " removing": 2813,
  "ants": 2814,
  "encies": 2815,
  " oxygen": 2816,
  "istic": 2817,
  " problems": 2818,
  ")^{": 2819,
  ",-": 2820,
  "ibri": 2821,
  "ribed": 2822,
  "uses": 2823,
  " individual": 2824,
  " meet": 2825,
  " looking": 2826,
  " independent": 2827,
  " examples": 2828,
  " call": 2829,
  "acing": 2830,
  " who": 2831,
  " ~": 2832,
  "append": 2833,
  "ansion": 2834,
  " defined": 2835,
  " coprime": 2836,
  " proportional": 2837,
  "agnetic": 2838,
  "each": 2839,
  " pow": 2840,
  " infinite": 2841,
  " road": 2842,
  " substrings": 2843,
  " stored": 2844,
  " convert": 2845,
  " differ": 2846,
  " princip": 2847,
  "oth": 2848,
  "ibrium": 2849,
  " missing": 2850,
  " alpha": 2851,
  "}$": 2852,
  "ensions": 2853,
  " sim": 2854,
  " super": 2855,
  "Sub": 2856,
  " polar": 2857,
  " region": 2858,
  " ≠": 2859,
  " forms": 2860,
  " disc": 2861,
  "ener": 2862,
  " union": 2863,
  " pi": 2864,
  "}=": 2865,
  "option": 2866,
  " 28": 2867,
  " symmetric": 2868,
  " below": 2869,
  "char": 2870,
  " tor": 2871,
  "Ex": 2872,
  " error": 2873,
  "((": 2874,
  "rol": 2875,
  " duplic": 2876,
  "ier": 2877,
  " conductor": 2878,
  "ivity": 2879,
  "Simplify": 2880,
  " optimized": 2881,
  "nter": 2882,
  "igen": 2883,
  "::": 2884,
  "39": 2885,
  " expected": 2886,
  " information": 2887,
  "forward": 2888,
  "ape": 2889,
  " mention": 2890,
  " 64": 2891,
  " repe": 2892,
  "umul": 2893,
  "ained": 2894,
  "St": 2895,
  "versal": 2896,
  " table": 2897,
  " infinity": 2898,
  " ring": 2899,
  " far": 2900,
  " types": 2901,
  "agr": 2902,
  "atter": 2903,
  " achieved": 2904,
  "tan": 2905,
  "stit": 2906,
  "fer": 2907,
  " overall": 2908,
  "iform": 2909,
  " sinθ": 2910,
  " cosθ": 2911,
  " pie": 2912,
  " physics": 2913,
  " assume": 2914,
  " typically": 2915,
  " decay": 2916,
  "ands": 2917,
  "  \n": 2918,
  "osp": 2919,
  " 27": 2920,
  " image": 2921,
  " As": 2922,
  "hip": 2923,
  " distances": 2924,
  "NA": 2925,
  " alternative": 2926,
  "81": 2927,
  " expansion": 2928,
  "ared": 2929,
  "$$$-": 2930,
  "                ": 2931,
  " bonds": 2932,
  " special": 2933,
  " internal": 2934,
  " relations": 2935,
  "oc": 2936,
  " asks": 2937,
  "ium": 2938,
  " reflection": 2939,
  "aring": 2940,
  " attack": 2941,
  " meters": 2942,
  " prior": 2943,
  ")}": 2944,
  " 256": 2945,
  " goes": 2946,
  " equilibrium": 2947,
  " underst": 2948,
  "How": 2949,
  "lusion": 2950,
  "candidate": 2951,
  "spe": 2952,
  "Total": 2953,
  " med": 2954,
  " $$$\\": 2955,
  " minutes": 2956,
  " results": 2957,
  " '.": 2958,
  "ificant": 2959,
  " relativ": 2960,
  " project": 2961,
  " changing": 2962,
  " polygon": 2963,
  "]:": 2964,
  "vent": 2965,
  "Put": 2966,
  " distribution": 2967,
  "bf": 2968,
  " compound": 2969,
  "OH": 2970,
  "assuming": 2971,
  " body": 2972,
  " sa": 2973,
  " decreasing": 2974,
  " decomp": 2975,
  "Looking": 2976,
  " active": 2977,
  "lose": 2978,
  " properties": 2979,
  " \\,": 2980,
  " ion": 2981,
  " trick": 2982,
  " Read": 2983,
  "}(": 2984,
  " hit": 2985,
  "dx": 2986,
  " neighbor": 2987,
  "ople": 2988,
  "}{\\": 2989,
  " arriv": 2990,
  " descending": 2991,
  "next": 2992,
  " reflect": 2993,
  " theorem": 2994,
  " radiation": 2995,
  "state": 2996,
  " eigen": 2997,
  " Sub": 2998,
  "199": 2999,
  " medi": 3000,
  " amount": 3001,
  "hand": 3002,
  " photons": 3003,
  "\n    \n   ": 3004,
  " bise": 3005,
  " diagonals": 3006,
  " series": 3007,
  "Sum": 3008,
  " relate": 3009,
  "Processing": 3010,
  " come": 3011,
  " ll": 3012,
  " loss": 3013,
  "^\\": 3014,
  " proper": 3015,
